'''你有一个电子钟，可以显示 0:00 到 23:59 之间的所有时间，以数字的形式显示。
其中小时是 0 到 23（0 时会显示一个 0，而 1 到 9 时不会显示前导 0），分钟是 00 到 59（0 到 9 分都会显示前导 0）。
任何时刻，电子钟都会显示三个或者四个 00 到 99 的数字。如果在某时刻，这些数字依次组成了一个等差数列，则这个时刻被称为“好时刻”。

你感觉很无聊，从 0:00 时刻开始盯着这个电子钟。一共盯了 x 分钟。请问整个过程中，"好时刻"来临了多少次（算上开头和结尾）？'''
# '''c++#include <iostream>
# using namespace std;
# typedef long long ll;
# int main()
# {
# 	ll n;
# 	scanf("%lld",&n);
# 	ll sum = 0,ans = 0;
# 	while(n > 1439)
# 	{
# 		n = n - 1440;
# 		ans += 39;
# 	}
# 	for(ll i = 0;sum <= n;i ++,sum ++ )
# 	{
# 		if(i == 1440)i = 0;
# 		if(i == 0 || i == 12 || i == 24 || i == 36 || i == 48 || i == 71 || i == 83 || i == 95 || i == 107 || i == 119 || i == 130 || i == 142 || i == 154 || i == 166 || i == 178 || i == 201 || i == 213 || i == 225 || i == 237 || i == 260 || i == 272 || i == 284 || i == 296 || i == 331 || i == 343 || i == 355 || i == 390 || i == 402 || i == 414 || i == 461 || i == 473 || i == 520 || i == 532 || i == 591 || i == 671 || i == 754 || i == 837 || i == 1342 || i == 1425)ans ++ ;
# 	}
# 	printf("%lld",ans);
# }'''
print(1234567%100000)